#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.covid_tracker_ui will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "covid_tracker_ui"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod/*",
            ]

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
        aliases                        = [
            "covidtracker.ph",
            "trackncovph.jclarino.com",
        ]
        arn                            = "arn:aws:cloudfront::780046271874:distribution/E1FQR0D7SQEOUW"
        caller_reference               = "terraform-20200513204351306500000001"
        comment                        = "Covid Tracker PH UI"
        domain_name                    = "d5vilgk0i4k76.cloudfront.net"
        enabled                        = true
        etag                           = "E3GUMOZ86VTYBJ"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E1FQR0D7SQEOUW"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2020-05-14 00:14:42.115 +0000 UTC"
        price_class                    = "PriceClass_100"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {
            "Environment" = "production"
        }
        wait_for_deployment            = true

        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 400
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 403
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 404
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 500
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 501
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 502
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 503
            response_code         = 0
        }

      ~ default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3-covid-tracker-ui-prod"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }

            lambda_function_association {
                event_type   = "origin-request"
                include_body = false
                lambda_arn   = "arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod:1"
            }
          + lambda_function_association {
              + event_type   = "viewer-response"
              + include_body = true
              + lambda_arn   = (known after apply)
            }
        }

        origin {
            domain_name = "covid-tracker-ui-prod.s3.ap-southeast-1.amazonaws.com"
            origin_id   = "S3-covid-tracker-ui-prod"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/EOLN20WS2FPT5"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

        viewer_certificate {
            acm_certificate_arn            = "arn:aws:acm:us-east-1:780046271874:certificate/825ca9a3-c78c-4a71-af9c-7595f9550dbb"
            cloudfront_default_certificate = false
            minimum_protocol_version       = "TLSv1.1_2016"
            ssl_support_method             = "sni-only"
        }
    }

  # aws_cognito_user_group.guest_user will be created
  + resource "aws_cognito_user_group" "guest_user" {
      + description  = "Managed by Terraform"
      + id           = (known after apply)
      + name         = "Guest-User"
      + user_pool_id = "ap-southeast-1_bwLZYmci6"
    }

  # aws_iam_role.guest_token_inserter will be created
  + resource "aws_iam_role" "guest_token_inserter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "edgelambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "static-ui-path-rewrite-lambda"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.guest_token_inserter_logging will be created
  + resource "aws_iam_role_policy_attachment" "guest_token_inserter_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "static-ui-path-rewrite-lambda"
    }

  # aws_lambda_function.guest_token_inserter will be created
  + resource "aws_lambda_function" "guest_token_inserter" {
      + arn                            = (known after apply)
      + filename                       = "./lambda_functions/ui-guest-token/function.zip"
      + function_name                  = "guest-token-inserter-prod"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + source_code_hash               = "Tx2xh/14u3bKSnum5G7/K9ctvXmo46rzuUSVwY2/Bi4="
      + source_code_size               = (known after apply)
      + timeout                        = 5
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.static_ui_path_rewrite will be updated in-place
  ~ resource "aws_lambda_function" "static_ui_path_rewrite" {
        arn                            = "arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod"
        filename                       = "./lambda_functions/ui-path-rewrite/function.zip"
        function_name                  = "static-ui-path-rewrite-prod"
        handler                        = "index.handler"
        id                             = "static-ui-path-rewrite-prod"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod/invocations"
        last_modified                  = "2020-05-13T20:43:37.788+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = true
        qualified_arn                  = "arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod:1"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/static-ui-path-rewrite-lambda"
      ~ runtime                        = "nodejs10.x" -> "nodejs12.x"
        source_code_hash               = "LifCgleVIaDiKvSx2AaciTMvAQd2bDvckaZQ6GZJCqs="
        source_code_size               = 69206
        tags                           = {}
        timeout                        = 5
        version                        = "1"

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_s3_bucket.covid_tracker_ui will be updated in-place
  ~ resource "aws_s3_bucket" "covid_tracker_ui" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::covid-tracker-ui-prod"
        bucket                      = "covid-tracker-ui-prod"
        bucket_domain_name          = "covid-tracker-ui-prod.s3.amazonaws.com"
        bucket_regional_domain_name = "covid-tracker-ui-prod.s3.ap-southeast-1.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3O0J2DXBE1FTB"
        id                          = "covid-tracker-ui-prod"
      ~ region                      = "ap-southeast-1" -> "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Name" = "covid-tracker-ui-prod"
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # aws_s3_bucket_policy.static_uis will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_uis" {
        bucket = "covid-tracker-ui-prod"
        id     = "covid-tracker-ui-prod"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5"
                        }
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5"
                        }
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.
```

</details>

*Workflow: `Infra Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `core`, Workspace: `default`*
